---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAnalyticalOpenings
source: html/9d1a1633-17a0-8fd2-597f-9dec33350d88.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface.GetAnalyticalOpenings Method

Returns the analytical openings of the analytical surface.

## Syntax (C#)
```csharp
public IList<EnergyAnalysisOpening> GetAnalyticalOpenings()
```

## Returns
The collection of analytical openings.